In [1]:
#import numpy and pandas
import numpy as np 
import pandas as pd

In [2]:
#import data set
titanic = pd.read_csv('train.csv')
titanic

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [3]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [4]:
#Confirming each PassengerId is unique in case there are double counts for things such as groupings of families
titanic['PassengerId'].is_unique

True

In [5]:
titanic['Survived'].value_counts()

0    549
1    342
Name: Survived, dtype: int64

In [6]:
# survival rate of the titanic
titanic_survival_rate = (titanic[titanic['Survived']==1]['Survived'].sum())/(titanic['Survived'].count())
titanic_survival_rate_percentage = "{:.2%}".format(titanic_survival_rate)
titanic_survival_rate_percentage

'38.38%'

In [7]:
#What is the survival rate between male and female
#change Gender Count to gender count or osmething better
data = titanic[['Survived','Sex']]
gender_survival_rate = pd.pivot_table(data,index='Sex', values='Survived', aggfunc=['sum','count']).reset_index()
gender_survival_rate.columns = gender_survival_rate.columns.map(' '.join)
gender_survival_rate = gender_survival_rate.rename(columns={'sum Survived':'Sum Survived', 'count Survived':'Gender Count'})
gender_survival_rate['Survival Rate'] = gender_survival_rate['Sum Survived']/gender_survival_rate['Gender Count']
gender_survival_rate['Survival Rate'] = gender_survival_rate['Survival Rate'].map("{:.2%}".format)
gender_survival_rate

     Sex   Sum Survived  Gender Count Survival Rate
0  female           233           314        74.20%
1    male           109           577        18.89%

In [8]:
#of the survivors, how many were underage(18) including the split between gender and their corresponding survival rate
data = titanic[['Survived','Sex']]
data['Underage'] = titanic['Age'] < 18
data['Underage'].replace([True,False],[0,1])
underage_survival_rate = pd.pivot_table(data, index='Sex', values=['Survived', 'Underage'], aggfunc=['sum','count']).reset_index()
underage_survival_rate.columns = underage_survival_rate.columns.map(' '.join)
underage_survival_rate = underage_survival_rate.rename(columns={'count Survived':'Gender Count'})

underage_survival_rate['Ratio of Underage by Gender'] = underage_survival_rate['sum Underage']/underage_survival_rate['sum Survived']
underage_survival_rate['Ratio of Underage by Gender'] = underage_survival_rate['Ratio of Underage by Gender'].map("{:.2%}".format)

underage_survival_rate['Ratio of Underage by Overall Survived'] = underage_survival_rate['sum Underage']/underage_survival_rate['Gender Count']
underage_survival_rate['Ratio of Underage by Overall Survived'] = underage_survival_rate['Ratio of Underage by Overall Survived'].map("{:.2%}".format)

underage_survival_rate = underage_survival_rate.drop(columns='count Underage')
underage_survival_rate = underage_survival_rate.style.hide_index()
underage_survival_rate

<ipython-input-8-928563f83a4c>:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  data['Underage'] = titanic['Age'] < 18

In [9]:
# # #What is the makeup for Pclass in the group that survived?
pclass_survival = titanic[['Pclass','Survived']]
pclass_survival = pclass_survival.groupby(['Pclass']).sum().reset_index().style.hide_index()
pclass_survival

In [10]:
#what is the gender make up and age_group make up for survivors in each pclass
#standard age grouping
#CHANGE THIS TO SHOW PERCENTAGES RATHER THAN NUMBERS
# Under 12 years old.
# 12-17 years old.
# 18-24 years old.
# 25-34 years old.
# 35-44 years old.
# 45-54 years old.
# 55-64 years old.
# 65-74 years old.

data = titanic[['Pclass','Survived','Sex','Age']]
data = data[data['Survived'] == 1]

data['Under 12 Years Old'] = (data['Age'] < 12).replace([True,False],[1,0])
data['12-17 Years Old'] = ((data['Age'] >= 12) & (data['Age'] <= 17)).replace([True,False],[1,0])
data['18-24 Years Old'] = ((data['Age'] >= 18) & (data['Age'] <= 24)).replace([True,False],[1,0])
data['25-34 Years Old'] = ((data['Age'] >= 25) & (data['Age'] <= 34)).replace([True,False],[1,0])
data['35-44 Years Old'] = ((data['Age'] >= 35) & (data['Age'] <= 44)).replace([True,False],[1,0])
data['45-54 Years Old'] = ((data['Age'] >= 45) & (data['Age'] <= 54)).replace([True,False],[1,0])
data['55-64 Years Old'] = ((data['Age'] >= 55) & (data['Age'] <= 64)).replace([True,False],[1,0])
data['65-74 Years Old'] = ((data['Age'] >= 65) & (data['Age'] <= 74)).replace([True,False],[1,0])
data['Over 74 Years Old'] = (data['Age'] > 74).replace([True,False],[1,0])

# data = data.drop(columns=['Age'])

survivor_age_gender = data.groupby(['Pclass','Sex']).agg({'Survived':'count','Under 12 Years Old':'sum','12-17 Years Old':'sum','18-24 Years Old':'sum','25-34 Years Old':'sum','35-44 Years Old':'sum','45-54 Years Old':'sum','55-64 Years Old':'sum','65-74 Years Old':'sum','Over 74 Years Old':'sum'}).reset_index()

survivor_age_gender
#NOTE TO SELF ADD GRAND TOTAL ROW AND COLUMN

,Pclass,Sex,Survived,Under 12 Years Old,12-17 Years Old,18-24 Years Old,25-34 Years Old,35-44 Years Old,45-54 Years Old,55-64 Years Old,65-74 Years Old,Over 74 Years Old
0,1,female,91,0,7,19,13,23,13,7,0,0
1,1,male,45,3,1,1,11,12,9,2,0,1
2,2,female,70,8,4,14,24,10,7,1,0,0
3,2,male,17,9,0,1,3,1,0,1,0,0
4,3,female,72,11,8,14,10,3,0,1,0,0
5,3,male,47,8,2,8,17,2,1,0,0,0

In [11]:
#Find the percentage for each gender and age group that makes up the survivors
data = survivor_age_gender
# data['Under 12 Years Old'].div(data.Survived, axis=0)
data[['Under 12 Years Old','12-17 Years Old','18-24 Years Old','25-34 Years Old','35-44 Years Old','45-54 Years Old','55-64 Years Old','65-74 Years Old','Over 74 Years Old']] = data[['Under 12 Years Old','12-17 Years Old','18-24 Years Old','25-34 Years Old','35-44 Years Old','45-54 Years Old','55-64 Years Old','65-74 Years Old','Over 74 Years Old']].div(data['Survived'], axis=0)
# x = data['Under 12 Years Old']/data['Survived']
survivor_age_gender_percentage = data

data[['Under 12 Years Old','12-17 Years Old','18-24 Years Old','25-34 Years Old','35-44 Years Old','45-54 Years Old','55-64 Years Old','65-74 Years Old','Over 74 Years Old']] = data[['Under 12 Years Old','12-17 Years Old','18-24 Years Old','25-34 Years Old','35-44 Years Old','45-54 Years Old','55-64 Years Old','65-74 Years Old','Over 74 Years Old']].applymap("{:.2%}".format)


survivor_age_gender_percentage

,Pclass,Sex,Survived,Under 12 Years Old,12-17 Years Old,18-24 Years Old,25-34 Years Old,35-44 Years Old,45-54 Years Old,55-64 Years Old,65-74 Years Old,Over 74 Years Old
0,1,female,91,0.00%,7.69%,20.88%,14.29%,25.27%,14.29%,7.69%,0.00%,0.00%
1,1,male,45,6.67%,2.22%,2.22%,24.44%,26.67%,20.00%,4.44%,0.00%,2.22%
2,2,female,70,11.43%,5.71%,20.00%,34.29%,14.29%,10.00%,1.43%,0.00%,0.00%
3,2,male,17,52.94%,0.00%,5.88%,17.65%,5.88%,0.00%,5.88%,0.00%,0.00%
4,3,female,72,15.28%,11.11%,19.44%,13.89%,4.17%,0.00%,1.39%,0.00%,0.00%
5,3,male,47,17.02%,4.26%,17.02%,36.17%,4.26%,2.13%,0.00%,0.00%,0.00%

In [12]:
#Does the data set have any null values
titanic.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [13]:
titanic.isnull().sum().sum()

866

In [14]:
#How many rows and columns does the data set have
titanic.shape

(891, 12)

In [15]:
#866 missing values, 687 missing values from cabin meaning at least 687 rows have a null value
#let's check if any if the null values overlap with each other
check_null = titanic[['Age','Cabin','Embarked']]
check_null.isnull().sum()

Age         177
Cabin       687
Embarked      2
dtype: int64

In [16]:
#I will be dropping the rows containing null values in cabin. if the amount of nulls also drops from the Age column after we dropped the rows with null values in Cabin column than we know that we have rows containing nulls in both columns
check_null.dropna(subset=['Cabin'], inplace=True)
check_null.isnull().sum()

<ipython-input-16-1f8cac5134f1>:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  check_null.dropna(subset=['Cabin'], inplace=True)

Age         19
Cabin        0
Embarked     2
dtype: int64

In [17]:
#Amount of null values in Age column dropped from 177 to 19 after dropping rows with null values in cabin column. 
# 687 + 19 + 2 = 866. 866/891 rows contains null values. 

#Since majority of the cabin entries are null(687/891), it is better to remove the column rather than dropping the rows with the null values as it latter will severely affect the data set

#For Age, it is best to replace the null values with the median since only 19/866 values are null and the median will affect the dataset less than if we were to replace the values with 0 or drop the rows entirely

#For the missing values in the Embarked column, I believe it is safe to drop the rows containing those null values as they are only 2/891 rows of the data set and ultimately not affect the data set to a noticeable degree. The reason for dropping instead of replacing with a value like the Age column is that Embark contains categorical data and dropping 2 rows will better than guessing and putting the most common value in place of the null values


titanic_cleaned = titanic.drop(columns='Cabin')
# titanic_cleaned.info()
titanic_cleaned.dropna(subset=['Embarked'], inplace=True)
titanic_cleaned['Age'].fillna(titanic_cleaned['Age'].mean(), inplace=True)
titanic_cleaned.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       0
dtype: int64

In [24]:
#Recreate table for survival rate based on pclass, gender and age group using the cleaned up data set

data = titanic_cleaned[['Pclass','Survived','Sex','Age']]
data = data[data['Survived'] == 1]

data['Under 12 Years Old'] = (data['Age'] < 12).replace([True,False],[1,0])
data['12-17 Years Old'] = ((data['Age'] >= 12) & (data['Age'] <= 17)).replace([True,False],[1,0])
data['18-24 Years Old'] = ((data['Age'] >= 18) & (data['Age'] <= 24)).replace([True,False],[1,0])
data['25-34 Years Old'] = ((data['Age'] >= 25) & (data['Age'] <= 34)).replace([True,False],[1,0])
data['35-44 Years Old'] = ((data['Age'] >= 35) & (data['Age'] <= 44)).replace([True,False],[1,0])
data['45-54 Years Old'] = ((data['Age'] >= 45) & (data['Age'] <= 54)).replace([True,False],[1,0])
data['55-64 Years Old'] = ((data['Age'] >= 55) & (data['Age'] <= 64)).replace([True,False],[1,0])
data['65-74 Years Old'] = ((data['Age'] >= 65) & (data['Age'] <= 74)).replace([True,False],[1,0])
data['Over 74 Years Old'] = (data['Age'] > 74).replace([True,False],[1,0])

data = data.drop(columns=['Age'])

survival_rate_pclass_gender_age = data.groupby(['Pclass','Sex']).agg({'Survived':'count','Under 12 Years Old':'sum','12-17 Years Old':'sum','18-24 Years Old':'sum','25-34 Years Old':'sum','35-44 Years Old':'sum','45-54 Years Old':'sum','55-64 Years Old':'sum','65-74 Years Old':'sum','Over 74 Years Old':'sum'}).reset_index()

survival_rate_pclass_gender_age[['Under 12 Years Old','12-17 Years Old','18-24 Years Old','25-34 Years Old','35-44 Years Old','45-54 Years Old','55-64 Years Old','65-74 Years Old','Over 74 Years Old']] = survival_rate_pclass_gender_age[['Under 12 Years Old','12-17 Years Old','18-24 Years Old','25-34 Years Old','35-44 Years Old','45-54 Years Old','55-64 Years Old','65-74 Years Old','Over 74 Years Old']].div(survival_rate_pclass_gender_age['Survived'], axis=0)

survival_rate_pclass_gender_age[['Under 12 Years Old','12-17 Years Old','18-24 Years Old','25-34 Years Old','35-44 Years Old','45-54 Years Old','55-64 Years Old','65-74 Years Old','Over 74 Years Old']] = survival_rate_pclass_gender_age[['Under 12 Years Old','12-17 Years Old','18-24 Years Old','25-34 Years Old','35-44 Years Old','45-54 Years Old','55-64 Years Old','65-74 Years Old','Over 74 Years Old']].applymap("{:.2%}".format)

survival_rate_pclass_gender_age

,Pclass,Sex,Survived,Under 12 Years Old,12-17 Years Old,18-24 Years Old,25-34 Years Old,35-44 Years Old,45-54 Years Old,55-64 Years Old,65-74 Years Old,Over 74 Years Old
0,1,female,89,0.00%,7.87%,21.35%,24.72%,24.72%,14.61%,6.74%,0.00%,0.00%
1,1,male,45,6.67%,2.22%,2.22%,35.56%,26.67%,20.00%,4.44%,0.00%,2.22%
2,2,female,70,11.43%,5.71%,20.00%,37.14%,14.29%,10.00%,1.43%,0.00%,0.00%
3,2,male,17,52.94%,0.00%,5.88%,29.41%,5.88%,0.00%,5.88%,0.00%,0.00%
4,3,female,72,15.28%,11.11%,19.44%,48.61%,4.17%,0.00%,1.39%,0.00%,0.00%
5,3,male,47,17.02%,4.26%,17.02%,55.32%,4.26%,2.13%,0.00%,0.00%,0.00%

In [18]:
#Did port of Embarked further determine pclass by grouping different pclasses to different areas of the ship?

In [19]:
#possibly look into parch, see if there were any relationships on the boat and further determine who they lossed if possible